# 1.1 Напишите программу, которая на входе получает имя пользователя, cохраняет его в переменную user_name и выводит строку  "Hello {user_name}!"
user_name = input("Enter your name:")
print(f"Hello, {user_name}!")

#1.2 Напишите программу, чтобы вывести:
#*********
#*       *
#*       *
#*********
print('**********')
print('*        *')
print('*        *')
print('**********')
print('*********\n*       *\n*       *\n*********')
print('*********\n*  *\n*  *\n*********')
